/**
 * SDK 对内部的错误全部使用了 QNRTCError 这个类做了封装，对外暴露了错误代码方面开发的时候定位和处理问题
 * @link https://doc.qnsdk.com/rtn/web/docs/api_error_code#docsNav
 */
export const QNRTCErrorCode = {
  11000: '未预期的错误',
  11001: '加入房间失败，RoomToken 认证失败',
  11002: '发布 ICE 失败',
  11003: '订阅 ICE 失败',
  11005: '订阅 P2P 发生错误',
  11006: '发布 P2P 发生错误',
  11007: '设备不兼容指定编解码格式',
  11008: '不支持当前功能',
  11009: '没有找到 Chrome 录屏插件',
  11010: '访问媒体设备被拒绝',
  11012: '找不到合流任务',
  11013: '访问屏幕共享被拒绝',
  11014: '订阅发布中止',
  10002: 'RoomToken 过期',
  10011: '房间人数已满',
  10022: '已经在其他设备登录',
  10004: '重新连接超时',
  10044: '不能订阅自己',
  10041: '指定的订阅对象没有发布',
  10051: '没有权限',
  10053: '参数错误'
};

/**
 * 其他原因导致和房间连接断开且不可恢复
 * @link https://doc.qnsdk.com/rtn/web/docs/api_track_mode_session#26_8
 */
export const QNRTCDisconnectCode = {
  10001: 'token 错误',
  10002: 'token 过期',
  10004: 'reconnect token 过期',
  10006: '面试已结束', // 被管理员踢出房间
  10007: '断线重连失败',
  10022: '该用户在其他页面或终端登录',
  10011: '房间人数已满'
};

/**
 * Response中code状态码
 * @link https://cf.qiniu.io/pages/viewpage.action?pageId=63570443
 */
export const ApiResponseCode = {
  0: '请求成功',
  400000: '参数错误',
  401001: '用户未登录或TOKEN过期',
  401002: '短信登录时，验证码错误',
  401003: 'TOKEN解析出错',
  401004: '用户已经登录',
  404001: '没有这个用户',
  404002: '没有这个面试',
  429001: '短信码发送请求过多',
  500000: '服务端内部错误',
  502001: '服务端外部错误',
  401000: '权限不足',
  404000: '当前请求接口不可用'
};

/**
 * HTTP状态码
 * @link https://cf.qiniu.io/pages/viewpage.action?pageId=63570443
 */
export const HTTPCode = {
  200: '请求成功',
  429: '请求过多',
  401: '无权限访问',
  405: '不支持该方法',
  504: '网关超时',
  503: '服务无存活',
  500: '服务内部错误'
};

